## Terraform Plan - Stage Branch

**Branch**: `stage`
**Commit**: `b60aa23bd6067b01fb38e8753577382dfbb97c1b`
**Author**: @satya-aws-iac
**Triggered**: Push to stage branch

#### Results:
- Format Check: `success`
- Initialization: `success`
- Validation: `success`
- Plan: `success`

<details><summary>📋 View Full Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "my-gke-cluster-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "satya-k8-poc"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_compute_subnetwork.subnet will be created
  + resource "google_compute_subnetwork" "subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "my-gke-cluster-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "satya-k8-poc"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "10.1.0.0/16"
              + range_name    = "pods"
            },
          + {
              + ip_cidr_range = "10.2.0.0/16"
              + range_name    = "services"
            },
        ]
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = false
      + enable_cilium_clusterwide_network_policy = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "us-central1-a"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "my-gke-cluster"
      + network                                  = "my-gke-cluster-vpc"
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = (known after apply)
      + remove_default_node_pool                 = true
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "my-gke-cluster-subnet"
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config {
          + horizontal_pod_autoscaling {
              + disabled = false
            }
          + http_load_balancing {
              + disabled = false
            }
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "services"
          + stack_type                    = "IPV4"
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "03:00"
            }
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled = (known after apply)

          + cidr_blocks {
              + cidr_block   = "0.0.0.0/0"
              + display_name = "All"
            }
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + workload_identity_config {
          + workload_pool = "satya-k8-poc.svc.id.goog"
        }
    }

  # google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "my-gke-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "my-gke-cluster-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "satya-k8-poc"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 3
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 30
          + disk_type         = "pd-standard"
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "dev"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "e2-small"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "gke-node",
              + "my-gke-cluster-gke",
            ]

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }
    }

  # google_project_iam_member.gke_nodes_log_writer will be created
  + resource "google_project_iam_member" "gke_nodes_log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "satya-k8-poc"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.gke_nodes_metric_writer will be created
  + resource "google_project_iam_member" "gke_nodes_metric_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "satya-k8-poc"
      + role    = "roles/monitoring.metricWriter"
    }

  # google_project_iam_member.gke_nodes_monitoring_viewer will be created
  + resource "google_project_iam_member" "gke_nodes_monitoring_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "satya-k8-poc"
      + role    = "roles/monitoring.viewer"
    }

  # google_project_iam_member.gke_nodes_resource_metadata_writer will be created
  + resource "google_project_iam_member" "gke_nodes_resource_metadata_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "satya-k8-poc"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # google_service_account.gke_nodes will be created
  + resource "google_service_account" "gke_nodes" {
      + account_id   = "my-gke-cluster-gke-nodes"
      + disabled     = false
      + display_name = "Service Account for GKE nodes"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "satya-k8-poc"
      + unique_id    = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_ca_certificate = (sensitive value)
  + cluster_endpoint       = (sensitive value)
  + cluster_name           = "my-gke-cluster"
  + machine_type           = "e2-small"
  + node_count             = 2
  + node_pool_name         = "my-gke-cluster-node-pool"
  + region                 = "us-central1"
  + subnet_name            = "my-gke-cluster-subnet"
  + vpc_name               = "my-gke-cluster-vpc"
  + zone                   = "us-central1-a"

```

</details>

---
**Next Steps**: 
- Review the plan above
- If approved, merge `stage` → `main` to apply changes
- [View Workflow Run](https://github.com/satya-aws-iac/gcp-eks/actions/runs/20086708076)
